#include "Example1.h"

/*
 * Атрибуты в C++ — это специальные ключевые слова, которые позволяют задавать дополнительную информацию для различных конструкций языка:
 * типов, переменных, функций, имён, блоков и единиц трансляции. Эта информация может быть использована компилятором для генерации более
 * эффективного кода и предоставления (или подавления) предупреждающих сообщений пользователю на уровне конкретных участков кода.
 */

int main()
{
    //Example1::test1();
    //Example1::test2();
    //Example1::test3();
    //Example1::test4();
    //Example1::test5();
    //Example1::test6();
    //Example1::test7();
    Example1::test8();

    return 0;
}
