#include "Example1.h"
#include "Example2.h"

/*
 * switch — это оператор выбора, который позволяет выполнить один из нескольких блоков кода в зависимости от значения выражения. Он удобен,
 * когда нужно проверить значение переменной и выполнить соответствующий блок кода без использования множества if-else.
 */

int main()
{
    {
        //Example1::test();
    }

    {
        //Example2::test1();
        //Example2::test2();
        //Example2::test3();
        //Example2::test4();
    }

    return 0;
}
